{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"tokens:0": {"name": "tokens:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4250"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "tokens", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "tokens", "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "unknown_1"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Shape", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/axes", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Shape", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/free", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_2", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Prod", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/Relu", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Reshape", "unknown_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot/MatMul", "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/conv_spacer1/dense/Tensordot", "unknown_3"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv_spacer1/dense/BiasAdd", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "shrink_axis_mask": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/conv_spacer1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/conv_spacer1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "unknown_2", "shape": [128, 1], "dtype": "float32"}, {"name": "unknown", "shape": [4250, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "shape": [1, 5, 64, 128], "dtype": "float32"}, {"name": "unknown_1", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_3", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2", "shape": [3], "dtype": "int32"}]}]}