{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"tokens:0": {"name": "tokens:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4250"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "11"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "896"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "tokens", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "tokens", "StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims_1", "unknown_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims_1", "unknown_3"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims_1", "unknown_5"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer3/conv1d/Relu", "StatefulPartitionedCall/conv_spacer3/conv1d_1/Relu", "StatefulPartitionedCall/conv_spacer3/conv1d_2/Relu", "StatefulPartitionedCall/conv_spacer3/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "4"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer3/concat", "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims_1", "unknown_7"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Shape", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/axes", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Shape", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/free", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_2", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Prod", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/conv_spacer3/conv1d_3/Relu", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Reshape", "unknown_8"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot/MatMul", "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/conv_spacer3/dense/Tensordot", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv_spacer3/dense/BiasAdd", "StatefulPartitionedCall/conv_spacer3/strided_slice/stack", "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_1", "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_2"], "attr": {"end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "4"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/conv_spacer3/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/conv_spacer3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "unknown_8", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d/conv1d/ExpandDims_1", "shape": [1, 5, 128, 256], "dtype": "float32"}, {"name": "unknown_1", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_1/conv1d/ExpandDims_1", "shape": [1, 7, 128, 256], "dtype": "float32"}, {"name": "unknown_3", "shape": [256], "dtype": "float32"}, {"name": "unknown", "shape": [4250, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_2/conv1d/ExpandDims_1", "shape": [1, 11, 128, 256], "dtype": "float32"}, {"name": "unknown_5", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/conv1d_3/conv1d/ExpandDims_1", "shape": [1, 5, 896, 256], "dtype": "float32"}, {"name": "unknown_7", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_9", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer3/strided_slice/stack_2", "shape": [3], "dtype": "int32"}]}]}